PTT3108/esp32-tts/src/WEB/Web.cpp
#ifdef PLATFORMIO_ESP32
#include <AsyncTCP.h>
#include <WiFi.h>
#include "SPIFFS.h"
#include <ESPmDNS.h>
#include <Update.h>
#include <esp_partition.h>
#include <esp_ota_ops.h>
#include <soc/uart_pins.h>
#include "Preferences.h"
#include "spi_flash_mmap.h"
#include <mbedtls/sha256.h>
#elif defined(ESP8266)
#include <ESP8266WiFi.h>
#include <ESPAsyncTCP.h>
#include <ESP8266mDNS.h>
#include "FS.h"
#elif defined(TARGET_RP2040)
#include <WebServer.h>
#include <WiFi.h>
#endif
#include "Arduino.h"
#include "WebContent.h"
#include "helps.h"
#include "common.h"

#include "Web.h"
#include "logging.h"

#include <ESPAsyncWebServer.h>
#include <DNSServer.h>
#include "device.h"

#include "stm32_ota.h"
#include "SENSOR/devSensor.h"

#include "ArduinoJson.h"

#include "PWM.h"
static const byte DNS_PORT = 53;
static IPAddress netMsk(255, 255, 255, 0);
static DNSServer dnsServer;
static IPAddress ipAddress(10, 0, 0, 1); // Địa chỉ IP tĩnh cho Access Point

static AsyncWebServer server(80);

const char *wifi_hostname = "TEST";
const char *wifi_ap_ssid = "TEST DEV";

#define WIFI_TAG "WIFI DEVICE"

static bool target_seen = false;
static uint32_t totalSize;
static bool force_update = false;
String Stm32_Target_Found = "ERROR";

Preferences preferences;

bool deviceStates[5] = {false, false, false, false, false};

void SensorhandleRequest(AsyncWebServerRequest *request)
{
    StaticJsonDocument<70> doc;
    JsonObject root = doc.to<JsonObject>();
    JsonObject dataObj = root.createNestedObject("data");

    // Cập nhật thông điệp cảm biến và nhận mã trạng thái
    int status = updateSensormessage(dataObj);
    String jsonString;
    serializeJson(doc, jsonString);
    ESP_LOGI("Measuarement", "Sensor: %s", jsonString);
    request->send(200, "application/json", jsonString);
}
static void initDevice()
{
    pinMode(DEVICE_1, OUTPUT);
    pinMode(DEVICE_2, OUTPUT);
    pinMode(DEVICE_3, OUTPUT);
    pinMode(DEVICE_4, OUTPUT);
    pinMode(DEVICE_5, OUTPUT);
}
void updateDeviceStates()
{
    digitalWrite(DEVICE_1, deviceStates[0] ? HIGH : LOW);
    digitalWrite(DEVICE_2, deviceStates[1] ? HIGH : LOW);
    digitalWrite(DEVICE_3, deviceStates[2] ? HIGH : LOW);
    digitalWrite(DEVICE_4, deviceStates[3] ? HIGH : LOW);
    digitalWrite(DEVICE_5, deviceStates[4] ? HIGH : LOW);
}
// Hàm tải trạng thái thiết bị từ NVS
void loadDeviceStates()
{
    ESP_LOGI(WIFI_TAG, "Loading device states from NVS...");
    for (int i = 0; i < 5; i++)
    {
        // Tên key cho mỗi thiết bị
        String key = "device" + String(i);
        // Lấy giá trị từ NVS, nếu không tìm thấy thì giữ nguyên giá trị hiện tại
        deviceStates[i] = preferences.getBool(key.c_str(), deviceStates[i]);
        ESP_LOGI(WIFI_TAG, "Loaded deviceStates[%d] = %s\n", i, deviceStates[i] ? "true" : "false");
    }
    updateDeviceStates();
}

// Hàm lưu trạng thái thiết bị vào NVS
void saveDeviceStates()
{
    for (int i = 0; i < 5; i++)
    {
        // Tên key cho mỗi thiết bị
        String key = "device" + String(i);
        // Lưu giá trị vào NVS
        preferences.putBool(key.c_str(), deviceStates[i]);
        // ESP_LOGI(WIFI_TAG,"Saved deviceStates[%d] = %s\n", i, deviceStates[i] ? "true" : "false");
    }
    updateDeviceStates();
}

String loadFilenameFromNVS()
{
    ESP_LOGI(WIFI_TAG, "Loading filename from NVS...");
    // Key cho filename
    const char *filenameKey = "filename";

    // Đọc chuỗi từ NVS, nếu không tìm thấy thì trả về chuỗi rỗng
    String filename = preferences.getString(filenameKey, "");

    if (filename.length() > 0)
    {
        ESP_LOGI(WIFI_TAG, "Loaded filename: %s\n", filename.c_str());
    }
    else
    {
        ESP_LOGI(WIFI_TAG, "No filename found in NVS.");
    }

    return filename;
}

void saveFilenameToNVS(const String &filename)
{
    ESP_LOGI(WIFI_TAG, "Saving filename to NVS...");
    // Key cho filename
    const char *filenameKey = "filename";

    // Lưu chuỗi vào NVS
    preferences.putString(filenameKey, filename);

    ESP_LOGI(WIFI_TAG, "Saved filename: %s\n", filename.c_str());
}
static struct
{
    const char *url;
    const char *contentType;
    const uint8_t *content;
    const size_t size;
} files[] = {
    // {"/scan.js", "text/javascript", (uint8_t *)SCAN_JS, sizeof(SCAN_JS)},
    {"/mui.js", "text/javascript", (uint8_t *)MUI_JS, sizeof(MUI_JS)},
    {"/LoraMesh.css", "text/css", (uint8_t *)LoraMesh_CSS, sizeof(LoraMesh_CSS)},
    {"/firmware_update.js", "text/javascript", (uint8_t *)firmware_update_CSS, sizeof(firmware_update_CSS)},
    // {"/hardware.html", "text/html", (uint8_t *)HARDWARE_HTML, sizeof(HARDWARE_HTML)},
    // {"/hardware.js", "text/javascript", (uint8_t *)HARDWARE_JS, sizeof(HARDWARE_JS)},
    // {"/cw.html", "text/html", (uint8_t *)CW_HTML, sizeof(CW_HTML)},
    // {"/cw.js", "text/javascript", (uint8_t *)CW_JS, sizeof(CW_JS)},
};

// Hàm cập nhật NVS
void savePWMConfigToNVS(uint32_t freq1, uint8_t dir1,
                        uint32_t freq2, uint8_t dir2,
                        uint32_t freq3, uint8_t dir3)
{
    preferences.putUInt("freq1", freq1);
    preferences.putUChar("dir1", dir1);

    preferences.putUInt("freq2", freq2);
    preferences.putUChar("dir2", dir2);

    preferences.putUInt("freq3", freq3);
    preferences.putUChar("dir3", dir3);

    ESP_LOGI("Stepper NVS", "PWM config saved to NVS");
    pwm.set_pwm(128, 127, freq1);
    WRITE(129, dir1);
    pwm.set_pwm(130, 127, freq2);
    WRITE(131, dir1);
    pwm.set_pwm(132, 127, freq3);
    WRITE(133, dir1);
}

// Hàm load NVS + áp dụng
void loadPWMConfigFromNVS()
{
    // Mặc định tần số 1000,1500,2000 Hz, dir = 0
    uint32_t freq1 = preferences.getUInt("freq1", 1000);
    uint8_t dir1 = preferences.getUChar("dir1", 0);

    uint32_t freq2 = preferences.getUInt("freq2", 1500);
    uint8_t dir2 = preferences.getUChar("dir2", 0);

    uint32_t freq3 = preferences.getUInt("freq3", 2000);
    uint8_t dir3 = preferences.getUChar("dir3", 0);

    ESP_LOGI("Stepper NVS", "Loaded PWM config from NVS:");
    ESP_LOGI("Stepper NVS", "CH1: freq=%u, dir=%u\n", freq1, dir1);
    ESP_LOGI("Stepper NVS", "CH2: freq=%u, dir=%u\n", freq2, dir2);
    ESP_LOGI("Stepper NVS", "CH3: freq=%u, dir=%u\n", freq3, dir3);
    pwm.set_pwm(128, 127, freq1);
    WRITE(129, dir1);
    pwm.set_pwm(130, 127, freq2);
    WRITE(131, dir1);
    pwm.set_pwm(132, 127, freq3);
    WRITE(133, dir1);
}

void handlePwmUpdate(AsyncWebServerRequest *request)
{
    int params = request->params();
    // Kiểm tra dữ liệu JSON trong body
    for (int i = 0; i < params; i++)
    {
        const AsyncWebParameter *p = request->getParam(i);
        ESP_LOGI("sacsac", "_POST[%s]: %s\n", p->name().c_str(), p->value().c_str());
    }
    if (request->hasArg("plain"))
    {
        String jsonBody = request->arg("plain"); // Chuỗi JSON

