PTT3108/esp32-tts/src/WEB/Web.cpp
        StaticJsonDocument<512> doc;
        DeserializationError err = deserializeJson(doc, jsonBody);
        if (err)
        {
            // JSON không hợp lệ
            request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
            return;
        }

        // Lấy freq và dir cho từng channel
        // Dùng toán tử | (hoặc) như một cách đặt giá trị mặc định
        uint32_t freq1 = doc["channel1"]["freq"] | 1000;
        uint8_t dir1 = doc["channel1"]["dir"] | 0;

        uint32_t freq2 = doc["channel2"]["freq"] | 1500;
        uint8_t dir2 = doc["channel2"]["dir"] | 0;

        uint32_t freq3 = doc["channel3"]["freq"] | 2000;
        uint8_t dir3 = doc["channel3"]["dir"] | 0;

        // 2. Lưu vào NVS
        savePWMConfigToNVS(freq1, dir1, freq2, dir2, freq3, dir3);

        // 3. Gửi phản hồi
        String response = "{\"status\":\"ok\",\"ch1\":{\"freq\":" + String(freq1) +
                          ",\"dir\":" + String(dir1) +
                          "},\"ch2\":{\"freq\":" + String(freq2) +
                          ",\"dir\":" + String(dir2) +
                          "},\"ch3\":{\"freq\":" + String(freq3) +
                          ",\"dir\":" + String(dir3) + "}}";

        request->send(200, "application/json", response);
    }
    else
    {
        // Không có "plain" => thiếu body
        request->send(400, "application/json", "{\"error\":\"No JSON body\"}");
    }
}
void handleGetPwmConfig(AsyncWebServerRequest *request)
{
    // Đọc cấu hình PWM/dir từ NVS, hoặc giá trị mặc định nếu chưa có
    uint32_t freq1 = preferences.getUInt("freq1", 0);
    uint8_t dir1 = preferences.getUChar("dir1", 0);

    uint32_t freq2 = preferences.getUInt("freq2", 0);
    uint8_t dir2 = preferences.getUChar("dir2", 0);

    uint32_t freq3 = preferences.getUInt("freq3", 0);
    uint8_t dir3 = preferences.getUChar("dir3", 0);

    // Dựng JSON trả về
    StaticJsonDocument<256> doc;
    doc["channel1"]["freq"] = freq1;
    doc["channel1"]["dir"] = dir1;
    doc["channel2"]["freq"] = freq2;
    doc["channel2"]["dir"] = dir2;
    doc["channel3"]["freq"] = freq3;
    doc["channel3"]["dir"] = dir3;

    String response;
    serializeJson(doc, response);

    // Gửi phản hồi 200 OK, nội dung JSON
    request->send(200, "application/json", response);
}

bool DEV_Wifi::initWiFi()
{
    connected = true;
    WiFi.disconnect(true);
    WiFi.mode(WIFI_OFF);
#if defined(PLATFORM_ESP8266)
    WiFi.forceSleepBegin();
#endif
    // registerButtonFunction(ACTION_START_WIFI, []()
    //                        { setWifiUpdateMode(); });
    // WiFi.onEvent(WiFiEvent);

    if (!preferences.begin("storage", false))
    {
        ESP_LOGI(WIFI_TAG, "Failed to initialize Preferences");
    }
    else
    {
        ESP_LOGI(WIFI_TAG, "Preferences initialized");
    }

    // Tải trạng thái thiết bị từ NVS
    loadDeviceStates();
    initDevice();
    updateDeviceStates();
    loadPWMConfigFromNVS();
    return true;
}

void DEV_Wifi::connectWiFi()
{
    ESP_LOGI(WIFI_TAG, "Switching to AP mode...");
    WiFi.disconnect();
#ifdef PLATFORMIO_ESP32
    WiFi.setHostname(ssid); // hostname must be set before the mode is set to STA
#endif
    WiFi.mode(WIFI_AP);
#ifdef PLATFORM_ESP8266
    WiFi.setHostname(wifi_hostname); // hostname must be set before the mode is set to STA
#endif

#ifdef PLATFORM_ESP8266
    WiFi.setOutputPower(13.5);
    WiFi.setPhyMode(WIFI_PHY_MODE_11N);
#elif PLATFORMIO_ESP32
    WiFi.setTxPower(WIFI_POWER_19_5dBm);
#endif

    // Configure AP settings
    WiFi.softAPConfig(ipAddress, ipAddress, netMsk);

    // Start Access Point
    if (WiFi.softAP(ssid, password))
    {
        ESP_LOGI(WIFI_TAG, "AP started with SSID: %s", ssid);
    }
    else
    {
        ESP_LOGE(WIFI_TAG, "Failed to start AP.");
    }

    // Start DN
    // char macStr[5];
    // snprintf(macStr, sizeof(macStr), "%04X", LoraMesher::getInstance().getLocalAddress());
    // Kết hợp SSID với MAC
    // char ap_ssid[50];
    // strncpy(ap_ssid, wifi_ap_ssid, sizeof(ap_ssid) - 1);
    // strncat(ap_ssid, "-", sizeof(wifi_ap_ssid) - strlen(wifi_ap_ssid) - 1);    // Thêm dấu "-"
    // strncat(ap_ssid, macStr, sizeof(wifi_ap_ssid) - strlen(wifi_ap_ssid) - 1); // Thêm MAC
    dnsServer.start(DNS_PORT, "*", ipAddress);
    ESP_LOGI(WIFI_TAG, "DNS server started on IP: %s", ipAddress.toString().c_str());

    startServices();
}
static void WebUpdateHandleRoot(AsyncWebServerRequest *request)
{
    force_update = request->hasArg("force");
    AsyncWebServerResponse *response;
    response = request->beginResponse(200, "text/html", (uint8_t *)INDEX_HTML, sizeof(INDEX_HTML));
    response = request->beginResponse(200, "text/html", (uint8_t *)INDEX_HTML, sizeof(INDEX_HTML));
    response->addHeader("Content-Encoding", "gzip");
    response->addHeader("Cache-Control", "no-cache, no-store, must-revalidate");
    response->addHeader("Pragma", "no-cache");
    response->addHeader("Expires", "-1");
    request->send(response);

    // Bắt đầu server
    server.begin();
}

static void WebUpdateSendContent(AsyncWebServerRequest *request)
{
    for (size_t i = 0; i < ARRAY_SIZE(files); i++)
    {
        if (request->url().equals(files[i].url))
        {
            AsyncWebServerResponse *response = request->beginResponse(200, files[i].contentType, files[i].content, files[i].size);
            response->addHeader("Content-Encoding", "gzip");
            request->send(response);
            return;
        }
    }
    request->send(404, "text/plain", "File not found");
}
static size_t firmwareOffset = 0;

static size_t getFirmwareChunk(uint8_t *data, size_t len, size_t pos)
{
    uint8_t *dst;
    uint8_t alignedBuffer[7];
    if ((uintptr_t)data % 4 != 0)
    {
        // If data is not aligned, read aligned byes using the local buffer and hope the next call will be aligned
        dst = (uint8_t *)((uint32_t)alignedBuffer / 4 * 4);
        len = 4;
    }
    else
    {
        // Otherwise just make sure len is a multiple of 4 and smaller than a sector
        dst = data;
        len = constrain((len / 4) * 4, 4, SPI_FLASH_SEC_SIZE);
    }

    ESP.flashRead(firmwareOffset + pos, (uint32_t *)dst, len);

    // If using local stack buffer, move the 4 bytes into the passed buffer
    // data is known to not be aligned so it is moved byte-by-byte instead of as uint32_t*
    if ((void *)dst != (void *)data)
    {
        for (unsigned b = len; b > 0; --b)
            *data++ = *dst++;
    }
    return len;
}

static void WebUpdateGetFirmware(AsyncWebServerRequest *request)
{
#ifdef PLATFORMIO_ESP32
    const esp_partition_t *running = esp_ota_get_running_partition();
    if (running)
    {
        firmwareOffset = running->address;
    }
#endif
    const size_t firmwareTrailerSize = 4096; // max number of bytes for the options/hardware layout json
    AsyncWebServerResponse *response = request->beginResponse("application/octet-stream", (size_t)ESP.getSketchSize() + firmwareTrailerSize, &getFirmwareChunk);
    String filename = String("attachment; filename=\"") + "_" + VERSION + ".bin\"";
    //   String filename = String("attachment; filename=\"") + (const char *)&target_name[4] + "_" + VERSION + ".bin\"";
    response->addHeader("Content-Disposition", filename);
    request->send(response);
}

static void HandleReboot(AsyncWebServerRequest *request)
{
    AsyncWebServerResponse *response = request->beginResponse(200, "application/json", "Kill -9, no more CPU time!");
    response->addHeader("Connection", "close");
    request->send(response);
    request->client()->close();
}
static void HandleReset(AsyncWebServerRequest *request)
{
    //   if (request->hasArg("hardware")) {
    //     SPIFFS.remove("/hardware.json");
    //   }
    //   if (request->hasArg("options")) {
    //     SPIFFS.remove("/options.json");
    //   }
    //   if (request->hasArg("model") || request->hasArg("config")) {
    //     config.SetDefaults(true);
    //   }
    AsyncWebServerResponse *response = request->beginResponse(200, "application/json", "Reset complete, rebooting...");
    response->addHeader("Connection", "close");
    request->send(response);
    request->client()->close();
    //   rebootTime = millis() + 100;
}

uint32_t updateCRC32(uint32_t crc, const uint8_t *data, size_t length)
{
    for (size_t i = 0; i < length; i++)
    {
        crc ^= data[i];
        for (int j = 0; j < 8; j++)
        {
            if (crc & 1)
            {
                crc = (crc >> 1) ^ 0xEDB88320;
            }
            else
            {
                crc >>= 1;
            }
        }
    }
    return crc;
}

