PTT3108/esp32-tts/src/WEB/Web.cpp
static void HandleSTM32Update(AsyncWebServerRequest *request,
                              const String &filename,
                              size_t index,
                              uint8_t *data,
                              size_t len,
                              bool final)
{
    static File uploadFile;               // Tệp tạm thời để lưu firmware
    static size_t totalBytesReceived = 0; // Tổng số byte đã nhận
    static uint32_t firmwareCRC = 0;

    // Lấy dung lượng file mong đợi từ header
    size_t filesize = request->header("X-FileSize").toInt();

    if (index == 0)
    {
        // Bắt đầu upload
        ESP_LOGI(WIFI_TAG, "Starting update: '%s' size=%u", filename.c_str(), filesize);

        uploadFile = SPIFFS.open(STM32_FRIMWARE_PATH, FILE_WRITE);
        if (!uploadFile)
        {
            ESP_LOGE(WIFI_TAG, "Failed to open file for writing");
            return; // Không thể ghi file -> thoát luôn
        }

        // Khởi tạo biến CRC với giá trị 0xFFFFFFFF (theo chuẩn CRC-32 IEEE)
        firmwareCRC = 0xFFFFFFFF;
        totalBytesReceived = 0;
    }

    // Ghi dữ liệu vào file nếu còn mở
    if (uploadFile)
    {
        uploadFile.write(data, len);
        totalBytesReceived += len;

        // Cập nhật CRC
        firmwareCRC = updateCRC32(firmwareCRC, data, len);

        ESP_LOGI(WIFI_TAG, "Received %u bytes, total: %u/%u",
                 len, totalBytesReceived, filesize);
    }

    // Nếu là chunk cuối (final == true)
    if (final)
    {
        // Đảo CRC để lấy giá trị cuối
        firmwareCRC ^= 0xFFFFFFFF;

        // Đóng file (quan trọng: nên đóng file trước khi xóa hay dùng tiếp)
        if (uploadFile)
        {
            uploadFile.close();
        }

        // Kiểm tra số byte đã nhận
        if (totalBytesReceived == filesize)
        {
            ESP_LOGI(WIFI_TAG, "Upload complete: '%s', total size: %u",
                     filename.c_str(), totalBytesReceived);

            // In CRC tính được
            ESP_LOGI(WIFI_TAG, "Calculated CRC-32: 0x%08X", firmwareCRC);

            // Đọc CRC mong đợi từ header (nếu client gửi)
            String expectedCRCHeader = request->header("X-CRC32");

            if (!expectedCRCHeader.isEmpty())
            {
                // Chuyển từ chuỗi hex sang số
                uint32_t expectedCRC = strtoul(expectedCRCHeader.c_str(), NULL, 16);
                ESP_LOGI(WIFI_TAG, "Expected CRC-32 from header: 0x%08X", expectedCRC);

                // So sánh
                if (firmwareCRC == expectedCRC)
                {
                    ESP_LOGI(WIFI_TAG, "CRC OK, proceed with firmware update.");

                    // Nếu CRC khớp -> ta có thể tiến hành update firmware
                    saveFilenameToNVS(filename);
                    devicesTriggerEvent(EVENT_UPDATE_FIRMWARE_STM32);
                }
                else
                {
                    // Nếu CRC không khớp -> xóa file, báo lỗi
                    ESP_LOGE(WIFI_TAG, "CRC mismatch! Removing the file.");
                    SPIFFS.remove(STM32_FRIMWARE_PATH);
                }
            }
            else
            {
                ESP_LOGW(WIFI_TAG, "No 'X-CRC32' header. Skip CRC check or handle error.");
                saveFilenameToNVS(filename);
                devicesTriggerEvent(EVENT_UPDATE_FIRMWARE_STM32);
            }
        }
        else
        {
            // Trường hợp không nhận đủ dữ liệu
            ESP_LOGE(WIFI_TAG,
                     "Upload incomplete. Expected: %u bytes, Received: %u bytes",
                     filesize, totalBytesReceived);

            // Xóa file do chưa nhận đủ
            SPIFFS.remove(STM32_FRIMWARE_PATH);
        }
    }
}

static void STM32UpdateResponseHandler(AsyncWebServerRequest *request)
{
    // vTaskDelay(1000 / portTICK_PERIOD_MS);
    if (request->header("X-FileSize").toInt() == 0)
    {
        Stm32_Target_Found = "ERROR";
        devicesTriggerEvent(EVENT_UPDATE_FIRMWARE_STM32);
    }
    vTaskDelay(1000 / portTICK_PERIOD_MS);
    if (Stm32_Target_Found != "ERROR")
    {
        String msg;
        // THÀNH CÔNG
        ESP_LOGI(WIFI_TAG, "Webresponse ");

        msg = String("{\"status\": \"ok\", \"msg\": \"Update complete. ");
        msg += "Please wait for a few seconds while the device " + Stm32_Target_Found + " reboots.\"}";

        AsyncWebServerResponse *response = request->beginResponse(200, "application/json", msg);
        response->addHeader("Connection", "close");
        request->send(response);
        Stm32_Target_Found = "ERROR";
    }
    else
    {
        // LỖI (có lỗi thật sự khi nạp)
        ESP_LOGI(WIFI_TAG, "Failed to upload firmware");

        // Tùy ý bạn ghi thêm mô tả lỗi nếu có
        String msg = "{\"status\": \"error\", \"msg\": \"Update failed " + Stm32_Target_Found + ".\"}";

        AsyncWebServerResponse *response = request->beginResponse(200, "application/json", msg);
        response->addHeader("Connection", "close");
        request->send(response);
    }
}

static void STM32UpdateForceUpdateHandler(AsyncWebServerRequest *request)
{
    if (request->arg("action").equals("confirm"))
    {
        STM32UpdateResponseHandler(request);
        request->send(200, "application/json", "{\"status\": \"ok\", \"msg\": \"Update cancelled\"}");
    }
    else
    {
        request->send(200, "application/json", "{\"status\": \"ok\", \"msg\": \"Update cancelled\"}");
    }
}

static void WebUpdateHandleNotFound(AsyncWebServerRequest *request)
{
    String message = F("File Not Found\n\n");
    message += F("URI: ");
    message += request->url();
    message += F("\nMethod: ");
    message += (request->method() == HTTP_GET) ? "GET" : "POST";
    message += F("\nArguments: ");
    message += request->args();
    message += F("\n");

    for (uint8_t i = 0; i < request->args(); i++)
    {
        message += String(F(" ")) + request->argName(i) + F(": ") + request->arg(i) + F("\n");
    }
    AsyncWebServerResponse *response = request->beginResponse(404, "text/plain", message);
    response->addHeader("Cache-Control", "no-cache, no-store, must-revalidate");
    response->addHeader("Pragma", "no-cache");
    response->addHeader("Expires", "-1");
    request->send(response);
}
static void startMDNS()
{
    if (!MDNS.begin(wifi_hostname))
    {
        ESP_LOGE(WIFI_TAG, "Error starting mDNS");
        return;
    }
    String instance = String(wifi_hostname) + "_" + WiFi.macAddress();
    instance.replace(":", "");
#if defined(PLATFORM_ESP8266)
    // We have to do it differently on ESP8266 as setInstanceName has the side-effect of chainging the hostname!
    MDNS.setInstanceName(wifi_hostname);
    MDNSResponder::hMDNSService service = MDNS.addService(instance.c_str(), "http", "tcp", 80);
    MDNS.addServiceTxt(service, "vendor", "test");
    // MDNS.addServiceTxt(service, "target", (const char *)&target_name[4]);
    // MDNS.addServiceTxt(service, "device", (const char *)device_name);
    // MDNS.addServiceTxt(service, "product", (const char *)product_name);
    MDNS.addServiceTxt(service, "version", VERSION);
    // MDNS.addServiceTxt(service, "options", options.c_str());
    MDNS.addServiceTxt(service, "type", "rx");
    // If the probe result fails because there is another device on the network with the same name
    // use our unique instance name as the hostname. A better way to do this would be to use
    // MDNSResponder::indexDomain and change wifi_hostname as well.
    MDNS.setHostProbeResultCallback([instance](const char *p_pcDomainName, bool p_bProbeResult)
                                    {
      if (!p_bProbeResult) {
        WiFi.hostname(instance);
        MDNS.setInstanceName(instance);
      } });
#else
    MDNS.setInstanceName(instance);
    MDNS.addService("http", "tcp", 80);
    MDNS.addServiceTxt("http", "tcp", "vendor", "test");
    MDNS.addServiceTxt("http", "tcp", "version", VERSION);
    MDNS.addServiceTxt("http", "tcp", "type", "update");
#endif
}
static void corsPreflightResponse(AsyncWebServerRequest *request)
{
    AsyncWebServerResponse *response = request->beginResponse(204, "text/plain");
    request->send(response);
}
static void WebUploadResponseHandler(AsyncWebServerRequest *request)
{
    if (target_seen || Update.hasError())
    {
        String msg;
        if (!Update.hasError() && Update.end())
        {
            ESP_LOGI(WIFI_TAG, "Update complete, rebooting");
            msg = String("{\"status\": \"ok\", \"msg\": \"Update complete. ");
#if defined(TARGET_RX)
            msg += "Please wait for the LED to resume blinking before disconnecting power.\"}";
#else
            msg += "Please wait for a few seconds while the device reboots.\"}";
#endif
        }
        else
        {
            StreamString p = StreamString();
            if (Update.hasError())
            {
                Update.printError(p);
            }
            else
            {
                p.println("Not enough data uploaded!");
            }
            p.trim();
            ESP_LOGI(WIFI_TAG, "Failed to upload firmware: %s", p.c_str());
            msg = String("{\"status\": \"error\", \"msg\": \"") + p + "\"}";
        }
        AsyncWebServerResponse *response = request->beginResponse(200, "application/json", msg);
        response->addHeader("Connection", "close");
        request->send(response);
        request->client()->close();
    }
    else
    {
        String message = String("{\"status\": \"mismatch\", \"msg\": \"<b>Current target:</b> ") + ".<br>";
        message += "<br/>It looks like you are flashing firmware with a different name to the current  firmware.  This sometimes happens because the hardware was flashed from the factory with an early version that has a different name. Or it may have even changed between major releases.";
        message += "<br/><br/>Please double check you are uploading the correct target, then proceed with 'Flash Anyway'.\"}";
        request->send(200, "application/json", message);
    }
}

static void WebUploadDataHandler(AsyncWebServerRequest *request, const String &filename, size_t index, uint8_t *data, size_t len, bool final)
{
    force_update = force_update || request->hasArg("force");
    if (index == 0)
    {
#if defined(TARGET_TX) && defined(PLATFORM_ESP32)
        WifiJoystick::StopJoystickService();
#endif

        size_t filesize = request->header("X-FileSize").toInt();
        ESP_LOGI(WIFI_TAG, "Update: '%s' size %u", filename.c_str(), filesize);
#if defined(PLATFORM_ESP8266)
        Update.runAsync(true);
        uint32_t maxSketchSpace = (ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000;
        ESP_LOGI(WIFI_TAG, "Free space = %u", maxSketchSpace);
        UNUSED(maxSketchSpace); // for warning
#endif
        if (!Update.begin(filesize, U_FLASH))
        { // pass the size provided
            Update.printError(Serial);
        }
        target_seen = false;
        totalSize = 0;
    }
    if (len)
    {
        ESP_LOGI(WIFI_TAG, "Writing %d bytes of firmware data.", len);

