PTT3108/esp32-tts/src/WEB/Web.cpp
        // Ghi dữ liệu vào bộ nhớ flash
        if (Update.write(data, len) == len)
        {
            // Vì force_update luôn bằng true, target_seen luôn là true
            target_seen = true; // Có thể loại bỏ nếu không sử dụng ở nơi khác

            // Cập nhật tổng kích thước đã ghi
            totalSize += len;

            // Ghi log thông báo ghi thành công
            ESP_LOGI(WIFI_TAG, "Successfully wrote %d bytes. Total written: %u bytes.", len, totalSize);
        }
        else
        {
            ESP_LOGE(WIFI_TAG, "Failed to write %d bytes of firmware data.", len);
        }
    }
}

void DEV_Wifi::startServices()
{
    server.on("/", WebUpdateHandleRoot);
    server.on("/LoraMesh.css", WebUpdateSendContent);
    server.on("/mui.js", WebUpdateSendContent);
    server.on("/firmware_update.js", WebUpdateSendContent);
    server.on("/firmware.bin", WebUpdateGetFirmware);

    server.on("/update/esp32", HTTP_POST, WebUploadResponseHandler, WebUploadDataHandler);
    server.on("/update/esp32", HTTP_OPTIONS, corsPreflightResponse);
    server.on("/update/stm32", HTTP_POST, STM32UpdateResponseHandler, HandleSTM32Update);
    server.on("/update/stm32", HTTP_OPTIONS, corsPreflightResponse);
    server.on("/forceupdate", STM32UpdateForceUpdateHandler);
    server.on("/forceupdate", HTTP_OPTIONS, corsPreflightResponse);

    server.on("/measurement", HTTP_GET, SensorhandleRequest);
    server.on("/stepperUpdate", HTTP_POST, [](AsyncWebServerRequest *request)
              {
    // Truyền sang hàm handlePwmUpdate
    handlePwmUpdate(request); });

    server.on("/getStepperConfig", HTTP_GET, handleGetPwmConfig);

    DefaultHeaders::Instance().addHeader("Access-Control-Allow-Origin", "*");
    DefaultHeaders::Instance().addHeader("Access-Control-Max-Age", "600");
    DefaultHeaders::Instance().addHeader("Access-Control-Allow-Methods", "POST,GET,OPTIONS");
    DefaultHeaders::Instance().addHeader("Access-Control-Allow-Headers", "*");

    server.on("/reboot", HandleReboot);
    server.on("/reset", HandleReset);

    server.on("/getStates", HTTP_GET, [](AsyncWebServerRequest *request)
              {
    String json = "[";
    for (int i = 0; i < 5; i++) {
      json += deviceStates[i] ? "true" : "false";
      if (i < 4) json += ",";
    }
    json += "]";
    request->send(200, "application/json", json); });

    // API: Thay đổi trạng thái thiết bị
    server.on("/setState", HTTP_GET, [](AsyncWebServerRequest *request)
              {
                ESP_LOGI("setStatast","SETETET");
    if (request->hasParam("index", false)) {
      int index = request->getParam("index", false)->value().toInt();
      if (index >= 1 && index <= 5) {
        deviceStates[index - 1] = !deviceStates[index - 1]; // Đảo trạng thái thiết bị
        saveDeviceStates();

        request->send(200, "application/json", "{\"message\":\"Device state toggled!\"}");
      } else {
        request->send(400, "application/json", "{\"message\":\"Invalid device index!\"}");
      }
    } else {
      request->send(400, "application/json", "{\"message\":\"Missing device index!\"}");
    } });

    server.on("/getversionfrimware", HTTP_GET, [](AsyncWebServerRequest *request)
              {
                    String filename = loadFilenameFromNVS();
    
    // Tạo phản hồi JSON
    String jsonResponse = "{\"filename\":\"" + filename + "\"}";
    
    // Gửi phản hồi
    request->send(200, "application/json", jsonResponse); });

    server.onNotFound(WebUpdateHandleNotFound);
    server.begin();

    dnsServer.start(DNS_PORT, "*", ipAddress);
    dnsServer.setErrorReplyCode(DNSReplyCode::NoError);

    startMDNS();
}

void DEV_Wifi::HandleWeb()
{
    wl_status_t status = WiFi.status();
    ESP_LOGI(WIFI_TAG, "WiFi status %d", status);
}
